Tekla.Structures.ModelInternal.dotBuildingHierarchyOverrideOperationType_e
Enumeration for BuildingHierarchy override operation types.

Tekla.Structures.ModelInternal.dotBuildingHierarchyOverrideOperationType_e.DOT_BH_OVERRIDE_CREATE
Add an object override.

Tekla.Structures.ModelInternal.dotBuildingHierarchyOverrideOperationType_e.DOT_BH_OVERRIDE_READ
Get all object overrides for parent object.

Tekla.Structures.ModelInternal.dotBuildingHierarchyOverrideOperationType_e.DOT_BH_OVERRIDE_UPDATE
Modify an object override.

Tekla.Structures.ModelInternal.dotBuildingHierarchyOverrideOperationType_e.DOT_BH_OVERRIDE_DELETE
Remove an object override.